; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v5)
		(pred_2 ?v8)
		(pred_1 ?v4)
		(pred_5 ?v4)
		(pred_6 ?v8 ?v4)
		(pred_3)
		(pred_4 ?v8))

   (:action op_1
       :parameters  (?v3 ?v7)
       :precondition (and (not-eq ?v3 ?v7) 
                          (pred_1 ?v3) (pred_1 ?v7) (pred_5 ?v3))
       :effect (and  (pred_5 ?v7)
		     (not (pred_5 ?v3))))


   (:action op_2
       :parameters (?v6 ?v2)
       :precondition  (and  (pred_2 ?v6) (pred_1 ?v2)
			    (pred_6 ?v6 ?v2) (pred_5 ?v2) (pred_3))
       :effect (and (pred_4 ?v6)
		    (not (pred_6 ?v6 ?v2)) 
		    (not (pred_3))))

   (:action op_3
       :parameters  (?v6  ?v2)
       :precondition  (and  (pred_2 ?v6) (pred_1 ?v2)
			    (pred_4 ?v6) (pred_5 ?v2))
       :effect (and (pred_6 ?v6 ?v2)
		    (pred_3)
		    (not (pred_4 ?v6)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_05 obj_08 obj_03 obj_01 obj_04 
          obj_06 obj_07 obj_02 
)
(:init
(pred_1 obj_05)
(pred_1 obj_08)
(pred_1 obj_03)
(pred_1 obj_01)
(pred_1 obj_04)
(pred_2 obj_06)
(pred_2 obj_07)
(pred_2 obj_02)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_3)
(pred_6 obj_06 obj_03)
(pred_6 obj_07 obj_05)
(pred_6 obj_02 obj_08)
(pred_5 obj_01)
)
(:goal
(and
(pred_6 obj_06 obj_04)
(pred_6 obj_07 obj_03)
(pred_6 obj_02 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_06 obj_04) (pred_5 obj_05))
    (sometime-before  (pred_6 obj_07 obj_03) (pred_5 obj_08))
    (sometime-before  (pred_6 obj_02 obj_05) (pred_5 obj_03))
  )
)
)

; plan
1. (op_1 obj_01 obj_04)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_04)
   goals met: 0 of 3
2. (op_1 obj_04 obj_03)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_03)
   goals met: 0 of 3
3. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_06 obj_03) (pred_3)
   added: (pred_4 obj_06)
   goals met: 0 of 3
4. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 0 of 3
5. (op_1 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_05)
   goals met: 0 of 3
6. (op_3 obj_06 obj_05)
   deleted: (pred_4 obj_06)
   added: (pred_6 obj_06 obj_05) (pred_3)
   goals met: 0 of 3
7. (op_1 obj_05 obj_08)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_08)
   goals met: 0 of 3
8. (op_2 obj_02 obj_08)
   deleted: (pred_6 obj_02 obj_08) (pred_3)
   added: (pred_4 obj_02)
   goals met: 0 of 3
9. (op_1 obj_08 obj_05)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_05)
   goals met: 0 of 3
10. (op_3 obj_02 obj_05)
   deleted: (pred_4 obj_02)
   added: (pred_6 obj_02 obj_05) (pred_3)
   goals met: 1 of 3
11. (op_2 obj_07 obj_05)
   deleted: (pred_6 obj_07 obj_05) (pred_3)
   added: (pred_4 obj_07)
   goals met: 1 of 3
12. (op_1 obj_05 obj_03)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_03)
   goals met: 1 of 3
13. (op_3 obj_07 obj_03)
   deleted: (pred_4 obj_07)
   added: (pred_6 obj_07 obj_03) (pred_3)
   goals met: 2 of 3
14. (op_1 obj_03 obj_04)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_04)
   goals met: 2 of 3
15. (op_1 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_05)
   goals met: 2 of 3
16. (op_2 obj_06 obj_05)
   deleted: (pred_6 obj_06 obj_05) (pred_3)
   added: (pred_4 obj_06)
   goals met: 2 of 3
17. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_04)
   goals met: 2 of 3
18. (op_3 obj_06 obj_04)
   deleted: (pred_4 obj_06)
   added: (pred_6 obj_06 obj_04) (pred_3)
   goals met: 3 of 3
